TF Plan output:

```

❯ ave auth-RoleTerraformApplier -- terragrunt plan
[INFO] Getting version from tgenv-version-name
[INFO] TGENV_VERSION is 0.48.2
2023/07/28 12:14:01 Enabling CSM
module.builder.data.aws_caller_identity.current: Reading...
module.builder.data.aws_region.current: Reading...
data.aws_iam_policy_document.ecr: Reading...
module.builder.module.builder_bucket.data.aws_caller_identity.current: Reading...
module.builder.data.aws_iam_policy_document.codebuild_assume_role: Reading...
module.builder.data.aws_ssm_parameter.github_api_token: Reading...
module.builder.data.aws_ssm_parameter.access_log_bucket_id: Reading...
module.builder.data.aws_region.current: Read complete after 0s [id=eu-west-2]
module.builder.module.builder_bucket.aws_kms_key.bucket_kms_key: Refreshing state... [id=396529a8-3b09-4546-984a-48251363155e]
module.builder.data.aws_iam_policy_document.project_assume_roles[0]: Reading...
module.builder.data.aws_iam_policy_document.codebuild_assume_role: Read complete after 0s [id=1229436035]
data.aws_iam_policy_document.ecr: Read complete after 0s [id=2380831857]
module.builder.data.aws_iam_policy_document.project_assume_roles[0]: Read complete after 0s [id=1708000458]
aws_iam_policy.ecr: Refreshing state... [id=arn:aws:iam::638924580364:policy/grant-user-access-container-release-builder20230728110225561200000001]
module.builder.aws_iam_policy.project_assume_roles[0]: Refreshing state... [id=arn:aws:iam::638924580364:policy/grant-user-access-container-rele20230727080159558600000001]
module.builder.data.aws_ssm_parameter.access_log_bucket_id: Read complete after 0s [id=access_log_bucket_id]
module.builder.data.aws_ssm_parameter.github_api_token: Read complete after 0s [id=/service_accounts/github_api_token]
module.builder.data.aws_caller_identity.current: Read complete after 0s [id=638924580364]
module.builder.data.aws_iam_session_context.current: Reading...
module.builder.module.builder_bucket.data.aws_caller_identity.current: Read complete after 0s [id=638924580364]
module.builder.module.builder_bucket.aws_s3_bucket.bucket: Refreshing state... [id=ci-grant-user-access-container-rele]
module.builder.data.aws_iam_session_context.current: Read complete after 1s [id=arn:aws:sts::638924580364:assumed-role/RoleTerraformApplier/1690542839107069000]
module.builder.aws_iam_policy.build: Refreshing state... [id=arn:aws:iam::638924580364:policy/grant-user-access-container-rele20230727080210946400000002]
module.builder.aws_iam_policy.build_core: Refreshing state... [id=arn:aws:iam::638924580364:policy/grant-user-access-container-rele20230727080210951500000003]
module.builder.aws_iam_role.build: Refreshing state... [id=grant-user-access-container-rele20230727080211519900000004]
module.builder.aws_codebuild_project.build: Refreshing state... [id=arn:aws:codebuild:eu-west-2:638924580364:project/grant-user-access-container-release-builder]
module.builder.aws_codebuild_webhook.build: Refreshing state... [id=grant-user-access-container-release-builder]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.builder.data.aws_iam_policy_document.bucket_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "bucket_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "DenyInsecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
      + statement {
          + actions   = [
              + "s3:DeleteBucket*",
              + "s3:GetAccelerateConfiguration",
              + "s3:GetAnalyticsConfiguration",
              + "s3:GetInventoryConfiguration",
              + "s3:GetMetricsConfiguration",
              + "s3:GetReplicationConfiguration",
              + "s3:PutAccelerateConfiguration",
              + "s3:PutAnalyticsConfiguration",
              + "s3:PutBucket*",
              + "s3:PutEncryptionConfiguration",
              + "s3:PutInventoryConfiguration",
              + "s3:PutLifecycleConfiguration",
              + "s3:PutMetricsConfiguration",
              + "s3:PutReplicationConfiguration",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
            ]
          + sid       = "DenyAdminActivities"

          + condition {
              + test     = "StringNotLike"
              + values   = [
                  + "arn:aws:iam::638924580364:role/RoleTerraformApplier",
                  + "arn:aws:iam::638924580364:role/RoleTerraformPlanner",
                  + "arn:aws:iam::979783897929:role/RoleTerraformProvisioner",
                ]
              + variable = "aws:PrincipalArn"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.builder.data.aws_iam_policy_document.build will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "build" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
              + "s3:PutObjectAcl",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.builder.data.aws_iam_policy_document.build_core will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "build_core" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + resources = [
              + "arn:aws:kms:eu-west-2:638924580364:key/396529a8-3b09-4546-984a-48251363155e",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetBucketVersioning",
              + "s3:GetObject",
              + "s3:GetObjectVersion",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateNetworkInterface",
              + "ec2:DeleteNetworkInterface",
              + "ec2:DescribeDhcpOptions",
              + "ec2:DescribeNetworkInterfaces",
              + "ec2:DescribeSecurityGroups",
              + "ec2:DescribeSubnets",
              + "ec2:DescribeVpcs",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateNetworkInterfacePermission",
            ]
          + resources = [
              + "arn:aws:ec2:eu-west-2:638924580364:network-interface/*",
            ]

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + "arn:aws:ec2:eu-west-2:638924580364:subnet/subnet-0be35d510b699ebb9",
                  + "arn:aws:ec2:eu-west-2:638924580364:subnet/subnet-04445759b76107987",
                  + "arn:aws:ec2:eu-west-2:638924580364:subnet/subnet-024c664aded7c3f7d",
                ]
              + variable = "ec2:Subnet"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "codebuild.amazonaws.com",
                ]
              + variable = "ec2:AuthorizedService"
            }
        }
    }

  # module.builder.aws_iam_policy.build will be updated in-place
  ~ resource "aws_iam_policy" "build" {
        id          = "arn:aws:iam::638924580364:policy/grant-user-access-container-rele20230727080210946400000002"
        name        = "grant-user-access-container-rele20230727080210946400000002"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObjectAcl",
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::ci-grant-user-access-container-rele/*/build_outp/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {
            "Step" = "grant-user-access-container-release-builder"
        }
        # (6 unchanged attributes hidden)
    }

  # module.builder.aws_iam_policy.build_core will be updated in-place
  ~ resource "aws_iam_policy" "build_core" {
        id          = "arn:aws:iam::638924580364:policy/grant-user-access-container-rele20230727080210951500000003"
        name        = "grant-user-access-container-rele20230727080210951500000003"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "kms:ReEncrypt*",
                          - "kms:GenerateDataKey*",
                          - "kms:Encrypt",
                          - "kms:DescribeKey",
                          - "kms:Decrypt",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:eu-west-2:638924580364:key/396529a8-3b09-4546-984a-48251363155e"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObjectVersion",
                          - "s3:GetObject",
                          - "s3:GetBucketVersioning",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::ci-grant-user-access-container-rele/*/source_out/*",
                          - "arn:aws:s3:::ci-grant-user-access-container-rele/*/build_outp/*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "ec2:DescribeVpcs",
                          - "ec2:DescribeSubnets",
                          - "ec2:DescribeSecurityGroups",
                          - "ec2:DescribeNetworkInterfaces",
                          - "ec2:DescribeDhcpOptions",
                          - "ec2:DeleteNetworkInterface",
                          - "ec2:CreateNetworkInterface",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action    = "ec2:CreateNetworkInterfacePermission"
                      - Condition = {
                          - ArnEquals    = {
                              - "ec2:Subnet" = [
                                  - "arn:aws:ec2:eu-west-2:638924580364:subnet/subnet-0be35d510b699ebb9",
                                  - "arn:aws:ec2:eu-west-2:638924580364:subnet/subnet-04445759b76107987",
                                  - "arn:aws:ec2:eu-west-2:638924580364:subnet/subnet-024c664aded7c3f7d",
                                ]
                            }
                          - StringEquals = {
                              - "ec2:AuthorizedService" = "codebuild.amazonaws.com"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:ec2:eu-west-2:638924580364:network-interface/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {
            "codebuild_project" = "grant-user-access-container-release-builder"
        }
        # (6 unchanged attributes hidden)
    }

  # module.builder.aws_iam_role.build will be updated in-place
  ~ resource "aws_iam_role" "build" {
        id                    = "grant-user-access-container-rele20230727080211519900000004"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::638924580364:policy/grant-user-access-container-release-builder20230728110225561200000001",
            # (3 unchanged elements hidden)
        ]
        name                  = "grant-user-access-container-rele20230727080211519900000004"
        tags                  = {
            "Step" = "grant-user-access-container-release-builder"
        }
        # (10 unchanged attributes hidden)
    }

  # module.builder.aws_s3_bucket_policy.bucket will be created
  + resource "aws_s3_bucket_policy" "bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.builder.module.builder_bucket.aws_kms_alias.bucket_kms_alias will be created
  + resource "aws_kms_alias" "bucket_kms_alias" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/s3-ci-grant-user-access-container-release-builder"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = "396529a8-3b09-4546-984a-48251363155e"
    }

  # module.builder.module.builder_bucket.aws_kms_key.bucket_kms_key will be updated in-place
  ~ resource "aws_kms_key" "bucket_kms_key" {
      ~ description                        = "KMS key used to encrypt files for ci-grant-user-access-container-rele" -> "KMS key used to encrypt files for ci-grant-user-access-container-release-builder"
        id                                 = "396529a8-3b09-4546-984a-48251363155e"
        tags                               = {}
        # (10 unchanged attributes hidden)
    }

  # module.builder.module.builder_bucket.aws_s3_bucket.bucket must be replaced
+/- resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::ci-grant-user-access-container-rele" -> (known after apply)
      ~ bucket                      = "ci-grant-user-access-container-rele" -> "ci-grant-user-access-container-release-builder" # forces replacement
      ~ bucket_domain_name          = "ci-grant-user-access-container-rele.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "ci-grant-user-access-container-rele.s3.eu-west-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3GKZC51ZF0DB4" -> (known after apply)
      ~ id                          = "ci-grant-user-access-container-rele" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "eu-west-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
          ~ "Name"              = "ci-grant-user-access-container-rele" -> "ci-grant-user-access-container-release-builder"
            "codebuild_project" = "grant-user-access-container-release-builder"
            "data_expiry"       = "90-days"
            "data_sensitivity"  = "low"
        }
      ~ tags_all                    = {
          ~ "Name"              = "ci-grant-user-access-container-rele" -> "ci-grant-user-access-container-release-builder"
            # (6 unchanged elements hidden)
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      - grant {
          - id          = "a70c13e66ef4c3f3c822fadb74ca4215950a95276e87433b7cced3f3e3cbed1b" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      ~ lifecycle_rule {
            id                                     = "AbortIncompleteMultipartUpload"
          - tags                                   = {} -> null
            # (2 unchanged attributes hidden)
        }
      ~ lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
            id                                     = "Expiration days"
          - tags                                   = {} -> null
            # (1 unchanged attribute hidden)

          ~ expiration {
              - expired_object_delete_marker = false -> null
                # (1 unchanged attribute hidden)
            }

            # (1 unchanged block hidden)
        }

      ~ logging {
          ~ target_prefix = "638924580364/ci-grant-user-access-container-rele/" -> "638924580364/ci-grant-user-access-container-release-builder/"
            # (1 unchanged attribute hidden)
        }

      ~ server_side_encryption_configuration {
          ~ rule {
              - bucket_key_enabled = false -> null

                # (1 unchanged block hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.builder.module.builder_bucket.aws_s3_bucket_ownership_controls.bucket_owner_enforced will be created
  + resource "aws_s3_bucket_ownership_controls" "bucket_owner_enforced" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # module.builder.module.builder_bucket.aws_s3_bucket_public_access_block.public_blocked will be created
  + resource "aws_s3_bucket_public_access_block" "public_blocked" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 5 to add, 4 to change, 1 to destroy.
╷
│ Warning: Argument is deprecated
│
│   with module.builder.module.builder_bucket.aws_s3_bucket.bucket,
│   on .terraform/modules/builder.builder_bucket/main.tf line 29, in resource "aws_s3_bucket" "bucket":
│   29: resource "aws_s3_bucket" "bucket" {
│
│ Use the aws_s3_bucket_lifecycle_configuration resource instead
│
│ (and 5 more similar warnings elsewhere)
╵

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```